In [1]:
import pandas as pd
import numpy as np

In [3]:
data=pd.read_csv('Pr1.csv')

In [5]:
data

   Sno Name Gender Division  Marks
0    1    A      F        A    NaN
1    2    B      F        B   20.0
2    3    C      M        B   15.0
3    4    D      F        A    8.0
4    5    E      M        B    9.0
5    6    F      F        A    NaN
6    7    G      M        B   19.0
7    8    H      M        A   16.0
8    9    I      M        A   20.0
9   10    J      F        B   17.0

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Sno       10 non-null     int64
 1   Name      10 non-null     object
 2   Gender    10 non-null     object
 3   Division  10 non-null     object
 4   Marks     8 non-null      float64
dtypes: float64(1), int64(1), object(3)
memory usage: 532.0+ bytes

In [7]:
data.isnull().sum()

Sno         0
Name        0
Gender      0
Division    0
Marks       2
dtype: int64

In [10]:
avg_marks=data['Marks'].mean()
print(avg_marks)

15.5

In [11]:
data['Marks'].replace(np.NaN,avg_marks,inplace=True)

C:\Users\seasp\AppData\Local\Temp\ipykernel_24616\4228160791.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['Marks'].replace(np.NaN,avg_marks,inplace=True)

In [13]:
data.isnull().sum()

Sno         0
Name        0
Gender      0
Division    0
Marks       0
dtype: int64

In [14]:
to_replace=['M','F']
value=[0,1]

In [15]:
data['Gender'].replace(to_replace,value,inplace=True)

C:\Users\seasp\AppData\Local\Temp\ipykernel_24616\1857573081.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['Gender'].replace(to_replace,value,inplace=True)
C:\Users\seasp\AppData\Local\Temp\ipykernel_24616\1857573081.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  data['Gender'].replace(to_replace,value,inplace=True)

In [16]:
data.head()

   Sno Name  Gender Division  Marks
0    1    A       1        A   15.5
1    2    B       1        B   20.0
2    3    C       0        B   15.0
3    4    D       1        A    8.0
4    5    E       0        B    9.0

In [17]:
data['Division'].replace(to_replace=['A','B'],value=[1,0],inplace=True)

C:\Users\seasp\AppData\Local\Temp\ipykernel_24616\1557600798.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['Division'].replace(to_replace=['A','B'],value=[1,0],inplace=True)
C:\Users\seasp\AppData\Local\Temp\ipykernel_24616\1557600798.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  data['Division'].replace(to_replace=['A','B'],value=[1,0],inplace=True)

In [18]:
data.head()

   Sno Name  Gender  Division  Marks
0    1    A       1         1   15.5
1    2    B       1         0   20.0
2    3    C       0         0   15.0
3    4    D       1         1    8.0
4    5    E       0         0    9.0

In [19]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Sno       10 non-null     int64
 1   Name      10 non-null     object
 2   Gender    10 non-null     int64
 3   Division  10 non-null     int64
 4   Marks     10 non-null     float64
dtypes: float64(1), int64(3), object(1)
memory usage: 532.0+ bytes